# ResetDisplacedElements Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
DisplacementElement..::..ResetDisplacedElements Method
DisplacementElement Class See Also
---
Sets the translation of the DisplacementElement to (0, 0, 0). The DisplacementElement continues to exist, but its elements are displayed in their actual location.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public void ResetDisplacedElements()
```

Visual Basic
---
```text
Public Sub ResetDisplacedElements
```

Visual C++
---
```text
public:
void ResetDisplacedElements()
```

# See Also
DisplacementElement Class
Autodesk.Revit.DB Namespace